Repository: lawrancej/logisim
Catalog: xlate/ru/doc/omegat-logisim-doc_ru-omegat.tmx
Source language: en
Languages: ru_ru

source: Whether that is true depends on what the Program does.
ru_ru: Являются ли они таковыми, зависит от того, что что именно делает Программа.

source: Releasing the mouse button reverts the knob back to its rest position.
ru_ru: Отпускание кнопки мыши возвращает рукоятку обратно в положение покоя.

source: Here, all three tunnels have the same label, a, and so the three points to which the tunnels point are connected.
ru_ru: Здесь все три тоннеля имеют одинаковую метку a, поэтому три точки, к которым подключены тоннели, соединены между собой.

source: From a technical point of view, it is relatively easy to deal with this level of sophistication in a single circuit.
ru_ru: С технической точки зрения относительно легко обойтись таким уровнем проработанности в одной схеме.

source: Continue counting
ru_ru: Продолжать счёт

source: The vertical positioning technique for the text relative to the label's official location (where the mouse was clicked in creating the label).
ru_ru: Метод вертикального выравнивания для текста по отношению к официальному расположению метки (тому месту, где произошло нажатие мыши при создании метки).

source: Using fireInvalidated notifies the propagation thread to
ru_ru: Использование fireInvalidated уведомляет поток просчёта о том,

source: Enable: When 0, all outputs consist of all floating bits, regardless of the data and select inputs.
ru_ru: Разрешить: когда 0, на всех выходах плавающие биты, независимо от данных и выбирающих входов.

source: Enable: When 0, all outputs consist of all floating bits (or zeros), regardless of the select input.
ru_ru: Разрешить: когда 0, на всех выходах плавающие биты (или нули), независимо от значения на выбирающем входе.

source: For example, 11001011 rotated left twice is 00101111.
ru_ru: Например, 11001011 циклически сдвинутое влево на два - это 00101111.

source: Menu reference
ru_ru: Справка по меню

source: The printer view, though, omits indications of state, and it omits such interface hints.
ru_ru: А вид для печати не показывает состояние и эти подсказки по интерфейсу.

source: Rows
ru_ru: Строки

source: * is created.
ru_ru: * новый экземпляр.

source: Command-line options
ru_ru: Параметры командной строки

source: It does not itself interact with other components.
ru_ru: Он сам по себе не взаимодействуют с другими компонентами.

source: Logisim References
ru_ru: Ссылки Logisim

source: Using a seven-segment display, shows the hexadecimal digit corresponding to the four-bit input.
ru_ru: Используя семисегментный индикатор, показывает шестнадцатеричную цифру, соответствующую четырёхбитному входу.

source: South edge, labeled c out (output, bit width 1)
ru_ru: Южный край, отмечен c out (выход, разрядность равна 1)

source: The circuit's inputs and outputs will be displayed in top-down order corresponding to how they appear under the Inputs and Outputs tabs.
ru_ru: Входы и выходы схемы будут отображены сверху вниз в порядке, соответствующем тому, как они следуют во вкладках Входы и Выходы.

source: The Inputs tab allows you to view and edit the list of inputs.
ru_ru: Вкладка Входы позволяет вам просматривать и редактировать список входов.

source: Graphically, they are similar but have slightly different borders: A pin has a thick, black border, whereas a probe has a thin, gray border.
ru_ru: Графически они похожи, но немного отличаются границами: контакт имеет толстую, чёрную границу, в то время как датчик - тонкую, серую границу.

source: Of course, you may use other packages' APIs, but they are more vulnerable to changes in future versions of Logisim.
ru_ru: Конечно, вы можете использовать API других пакетов, но они более уязвимы к изменениям в будущих версиях Logisim.

source: This constructor is how
ru_ru: Этот конструктор - это то, к чему

source: Subcircuits
ru_ru: Подсхемы

source: The inputs into the component.
ru_ru: Входы компонента.

source: // This is essentially the same as with SimpleGrayCounter, except for
ru_ru: // Это по существу так же, как и с SimpleGrayCounter, за исключением

source: Undo XX
ru_ru: Отменить XX

source: Logisim does not follow any standard exactly; it steers a middle ground to allow switching between them.
ru_ru: Logisim не соответствует какому-либо стандарту в точности; он придерживается середины чтобы переключаться между ними.

source: North edge, fourth from left (input, bit width 1)
ru_ru: Северный край, четвёртый слева (вход, разрядность равна 1)

source: Opening Combinational Analysis
ru_ru: Открытие окна Комбинационный анализ

source: // in future propagations.
ru_ru: // в следующих просчётах.

source: Theldo Cruz Franqueira, Thanos Kakarountas, Ilia Lilov, Pablo Leal Ramos, and Uwe Zimmermann, who have contributed to translations packaged with Logisim.
ru_ru: Телдо Круз Франкуэйра, Танос Какароунтас, Илья Лилов, Пабло Лил Рамос, и Уве Зиммерманн, которые внесли свой вклад в переводы, поставляемые с Logisim.

source: You may charge a fee for the physical act of transferring a copy, and you may at your option offer warranty protection in exchange for a fee.
ru_ru: Вы можете назначить плату за физический акт передачи копии и можете по своему усмотрению предоставлять гарантии за вознаграждение.

source: Remove Circuit
ru_ru: Удалить схему

source: I am generally willing to answer occasional requests for help.
ru_ru: Я в целом готов ответить на некоторые просьбы о помощи.

source: These are documented in the Library Reference.
ru_ru: Они описаны в Справке по библиотеке.

source: MRJAdapter, from Steve Roy
ru_ru: MRJAdapter, от Стива Роя

source: Outputs 0 normally; but when the user is pressing the the button using the Poke Tool, the output is 1.
ru_ru: В нормальном состоянии на выходе 0, но когда пользователь нажимает кнопку Инструментом Нажатие, на выходе 1.

source: These students put up with many bugs, and I am very appreciative for their patience and for their suggestions!
ru_ru: Эти студенты мирились с многими ошибками, и я очень признателен за их терпение и за их предложения!

source: The output, which always matches the input into the left side.
ru_ru: Выход, значение на котором всегда совпадает со значением на входе с левой стороны.

source: When this is checked, Logisim will replace all instances of the characters with the appropriate equivalent 7-bit ASCII characters.
ru_ru: Когда это включено, Logisim будет заменять все вхождения таких символов соответствующими эквивалентными символами из 7-битного набора символов ASCII.

source: Besides the clock input, the component also includes an enable input, which leads the clock input to be ignored when enable is 0, and the reset input, which resets the component's value asynchronously to the initial seed r0.
ru_ru: Кроме тактового входа, компонент имеет вход включение, который заставляет компонент игнорировать тактовый вход, если на входе включение 0; и вход сброс, который асинхронно сбрасывает значение компонента на начальное семя r0.

source: When the component is selected or being added, the digits '0' through '9' alter its Fan Out attribute, Alt-0 through Alt-9 alter both the Fan Out and Bit Width In attributes, and the arrow keys alter its Facing attribute.
ru_ru: Когда компонент выбран, или уже добавлен, клавиши от 0 до 9 меняют его атрибут Веерный выход, комбинации от Alt-0 до Alt-9 меняют оба атрибута - Веерный выход и Разрядность входа, а клавиши со стрелками меняют его атрибут Направление.

source: Creating bundles
ru_ru: Создание пучков

source: If the file uses circuits from a loaded Logisim library, those components are considered to be black boxes: The contents of the library's circuits are not included in the unique and recursive counts.
ru_ru: Если файл использует схемы из загруженной библиотеки Logisim, то эти компоненты считаются чёрными ящиками: содержимое схем библиотеки не включается в количество уникальных и подсчитанных рекурсивно.

source: Library: The name of the library from which the component came.
ru_ru: Библиотека: название библиотеки, из которой взят компонент.

source: It raises the currently selected object(s) so that it is drawn (or they are drawn) on top of an object that currently overlaps the selection.
ru_ru: Он поднимает выделенный в данный момент объект(ы) так, чтобы он оказался над объектом, перекрывающим выделение.

source: The direction toward which the tunnel points.
ru_ru: Направление, на которое указывает тоннель.

source: Add Tool adds the currently selected tool in the explorer at left to the end of the toolbar.
ru_ru: Добавить инструмент добавляет выбранный в проводнике слева инструмент в конец панели инструментов.

source: The File menu
ru_ru: Меню Файл

source: The high level value indicates that the register should update continuously whenever the clock input is 1.
ru_ru: Значение Высокий уровень означает, что регистр должен обновляться непрерывно, пока на тактовом входе 1.

source: (Some other Free Software Foundation software is covered by the GNU Library General Public License instead.) You can apply it to your programs, too.
ru_ru: (Вместо нее для части ПО Фонда Свободного ПО применяется Универсальная Общественная Лицензия GNU для библиотек.) Вы тоже можете использовать ее для своих программ.

source: It is intended as an educational tool, to help you learn how circuits work.
ru_ru: Он задуман как образовательный инструмент, чтобы помочь вам узнать, как работают схемы.

source: East edge, labeled Q, north end (output, bit width 1)
ru_ru: Восточный край, отмечен Q, северный контакт (выход, разрядность равна 1)

source: I am very grateful to these colleges for giving me the time and resources to work on this project.
ru_ru: Я очень благодарен этим учреждениям за предоставленные мне время и ресурсы для работы над этим проектом.

source: You can also reorder the inputs (which affects the order of columns in the truth table and in the generated circuit) using the Move Up or Move Down buttons on an input.
ru_ru: Вы также можете изменять порядок входов (который влияет на порядок столбцов в таблице истинности и в построенной схеме), используя кнопки Сдвинуть вверх или Сдвинуть вниз на выбранном входе.

source: Libraries and attributes
ru_ru: Библиотеки и атрибуты

source: The borrow bit computed for the difference.
ru_ru: Бит займа, вычисленный для разности.

source: Tool attributes
ru_ru: Атрибуты инструментов

source: By default, when you click the mouse in Logisim's drawing area, the currently selected tool will be used.
ru_ru: По умолчанию, когда вы щёлкаете мышью в области отрисовки Logisim, будет использоваться выбранный в данный момент инструмент.

source: Via the Window menu
ru_ru: Через меню Окно

source: Note that in
ru_ru: Отметим, что при

source: I recommend keeping this option off, as this technique does introduce rare errors with normal circuits.
ru_ru: Я рекомендую держать эту опцию выключенной, так как эта техника приводит к необычным ошибкам в нормальных схемах.

source: Remove removes the currently selected item from the toolbar.
ru_ru: Удалить удаляет выбранный элемент с панели инструментов.

source: The toolbar may be placed on any of the window's four borders, described as north, south, east, and west.
ru_ru: Панель инструментов может быть расположена вдоль любой из границ окна, обозначенных как север, юг, восток и запад.

source: In either case, its bit width matches the Data Bits attribute, and its location is specified by the Facing attribute.
ru_ru: В обоих случаях его разрядность соответствует атрибуту Биты данных, а его положение определено атрибутом Направление.

source: package com.cburch.gray; import com.cburch.logisim.data.Attribute; import com.cburch.logisim.data.BitWidth; import com.cburch.logisim.data.Bounds; import com.cburch.logisim.data.Value; import com.cburch.logisim.instance.InstanceFactory; import com.cburch.logisim.instance.InstancePainter; import com.cburch.logisim.instance.InstanceState; import com.cburch.logisim.instance.Port; import com.cburch.logisim.instance.StdAttr; /** This component takes a multibit input and outputs the value that follows it
ru_ru: package com.cburch.gray; import com.cburch.logisim.data.Attribute; import com.cburch.logisim.data.BitWidth; import com.cburch.logisim.data.Bounds; import com.cburch.logisim.data.Value; import com.cburch.logisim.instance.InstanceFactory; import com.cburch.logisim.instance.InstancePainter; import com.cburch.logisim.instance.InstanceState; import com.cburch.logisim.instance.Port; import com.cburch.logisim.instance.StdAttr; /** Этот компонент принимает многобитное значение на входе и выдаёт значение, следующее за ним

source: Using JAR libraries
ru_ru: Использование JAR библиотек

source: (Empty circuits are not displayed as options.) Logisim will print one circuit per page.
ru_ru: (Пустые схемы не отображаются как варианты.) Logisim будет печатать по одной схеме на каждой странице.

source: This section discusses project options; application preferences are described in another section.
ru_ru: В этом разделе рассматриваются параметры проекта; настройки приложения описаны в другом разделе.

source: Controls the upper vertical segment on the left side.
ru_ru: Управляет верхним вертикальным сегментом на левой стороне.

source: West edge, bottom pin (input, bit width 1)
ru_ru: Западный край, нижний контакт (вход, разрядность равна 1)

source: South edge (input, bit width 1)
ru_ru: Южный край (вход, разрядность равна 1)

source: The value to be routed to one of the outputs on the east edge.
ru_ru: Значение, которое будет перенаправлено на один из выходов на восточном крае.

source: After editing the circuit to appear like a 2:1 multiplexer, we might end up with the following circuit.
ru_ru: Отредактировав схему так, чтобы она выглядела как мультиплексор 2:1, мы получим следующую схему.

source: Additionally, the user may type the left-arrow and right-arrow keys to change the location of the cursor within the buffer, and the user may type the delete key to delete the buffer character (if any) just to the right of the cursor.
ru_ru: В дополнение, пользователь может нажимать клавиши стрелка влево и стрелка вправо чтобы переместить курсор внутри буфера и клавишу Delete для удаления символ справа от курсора (если он есть).

source: // StdAttr.WIDTH attribute to determine the bit width to work with.
ru_ru: // атрибут StdAttr.WIDTH чтобы задать разрядность.

source: In this case, we need to set up the location
ru_ru: В этом случае мы должны задать расположение

source: The value at this control pin affects how the component behaves:
ru_ru: Значение на этот управляющем контакте определяет поведение компонента:

source: The Project menu
ru_ru: Меню Проект

source: In particular, the shaped gates are more square than the dimensions defined by the relevant IEEE standard.
ru_ru: В частности, фигурные элементы более квадратные, чем должны быть по размерам, установленным соответствующим стандартом IEEE.

source: Arithmetic Right: All bits in data are shifted down dist places, with the upper dist places filled with repetitions of whatever the uppermost bit in data.
ru_ru: Арифметический правый: все биты в данные сдвигаются вниз на дистанция позиций, а верхние дистанция позиций заполняются повторениями самого верхнего бита в данные.

source: Each input data value is numbered, starting with 0 on the north.
ru_ru: Каждое значение входных данных нумеруется, начиная с 0 на севере.

source: You are not responsible for enforcing compliance by third parties to this License.
ru_ru: Вы не несете ответстенности за соблюдение третьими лицами условий этой Лицензии.

source: The output, whose value is the complement of the input value.
ru_ru: Выход, значение на котором будет дополнением для значения на входе.

source: A pin is an output or an input to a circuit, depending on the value of its Output?
ru_ru: Контакт - это выход или вход схемы, в зависимости от значения атрибута Выход?

source: Clear - when 1, the terminal is cleared of all data, and all other inputs are ignored.
ru_ru: Очистка - когда значение равно 1, терминал очищается от всех данных, и все другие входы игнорируются.

source: lowest precedence
ru_ru: низший приоритет

source: Emits a single value onto a wire.
ru_ru: Выдаёт на провод одиночное значение.

source: Plexers library
ru_ru: Библиотека Плексоры

source: Outputs the complement of the value currently stored by the flip-flop.
ru_ru: Выдаёт дополнение для значения, хранящегося в данный момент в триггере.

source: As we'll see on the next page, any don't-care values allow the computation of minimized expressions some flexibility.
ru_ru: Как мы увидим на следующей странице, каждое значение "не важно" придаёт вычислению минимизированных выражений некоторую гибкость.

source: count
ru_ru: счёт

source: I welcome e-mails about Logisim, including bug reports, suggestions, and fixes.
ru_ru: Я приветствую электронную почту о Logisim, в том числе сообщения об ошибках, предложения и исправления.

source: (See the `Debugging subcircuits' section of the User's Guide.)
ru_ru: (См. раздел "Отладка подсхем" Руководства пользователя.)

source: The user might
ru_ru: Пользователь может

source: Menu Reference
ru_ru: Справка по меню

source: On Color
ru_ru: Цвет включенных

source: The File tab
ru_ru: Вкладка Файл

source: And bug reports and suggestions for improvements, of course, are always welcome.
ru_ru: И сообщения об ошибках и предложения по улучшению, конечно, всегда приветствуются.

source: Subtractor
ru_ru: Вычитатель

source: If, however, the user presses the Alt key at a point in the middle of the wire, then the green circle will disappear.
ru_ru: Если пользователь нажимает клавишу Alt при прохождении мыши над проводом, то зелёный кружочек исчезает.

source: These actions are prohibited by law if you do not accept this License.
ru_ru: Эти действия запрещены законом, если вы не принимаете к соблюдению эту Лицензию.

source: If you cannot distribute so as to satisfy simultaneously your obligations under this License and any other pertinent obligations, then as a consequence you may not distribute the Program at all.
ru_ru: Если вы не можете заниматься распространением так, чтобы одновременно удовлетворить требованиям и этой Лицензии, и всем другим требованиям, то вы не должны заниматься распространением Программы.

source: Double-click or press the Enter key to complete the shape.
ru_ru: Дважды щёлкните или нажмите клавишу Enter для завершения фигуры.

source: For example, if you hover over a subcircuit component's pin, it will display the label of the corresponding pin within the subcircuit.
ru_ru: Например, если вы подержите указатель над контактом компонента подсхемы, то отобразится метка соответствующего контакта внутри подсхемы.

source: The component's control input.
ru_ru: Управляющий вход компонента.

source: Closes the current window.
ru_ru: Закрывает текущее окно.

source: Stay at value
ru_ru: Оставаться на значении

source: They also are different in that the probe does not have a Data Bits attribute to be configured: The bit width is inferred from whatever value it happens to see on its input.
ru_ru: Кроме того, они отличаются тем, что датчик не имеет атрибута Биты данных: разрядность определяется из значения, поступающего на вход компонента.

source: ColorPicker, from Jeremy Wood
ru_ru: ColorPicker, от Джереми Вуда

source: Blue: The wire carries a one-bit value, but nothing is driving a specific value onto the wire.
ru_ru: Синий: Провод несёт однобитное значение, но ничто не передаёт определённое значение проводу.

source: If the software is modified by someone else and passed on, we want its recipients to know that what they have is not the original, so that any problems introduced by others will not reflect on the original authors' reputations.
ru_ru: Если ПО модифицируется и передается кем-то еще, мы хотим, чтобы получатели ПО знали, что то, что у них есть --- это не оригинал, чтобы любые проблемы, созданные другими, не отразились на репутации первоначальных авторов.

source: In addition, mere aggregation of another work not based on the Program with the Program (or with a work based on the Program) on a volume of a storage or distribution medium does not bring the other work under the scope of this License.
ru_ru: Кроме того, простое нахождение другого произведения, не основанного на этой Программе, совместно с Программой (или с произведением, основанным на этой Программе) на том же носителе для постоянного хранения или распространяемом носителе не распространяет действие этой Лицензии на другое произведение.

source: If, while the ld input is 0, the address or data changes, then an additional store occurs.
ru_ru: Если адрес или данные меняются, пока значение на входе ld 0, то происходит дополнительная операция записи.

source: Clear all application preferences at startup, so Logisim will act as if it were being executed on the host system for the first time.
ru_ru: Очистить все настройки приложения при запуске, так что Logisim будет вести себя так, как будто он запущен в данной системе первый раз.

source: It is also consistent with the intuitive meaning underlying the term exclusive or: A waiter asking whether you want a side dish of mashed potatoes, carrots, peas, or cole slaw will only accept one choice, not three, whatever some authorities may tell you.
ru_ru: Это также согласуется с интуитивным пониманием термина Исключающее ИЛИ: официант, спрашивающий, хотите вы гарнир из картофельного пюре, моркови, зеленого горошка, или шинкованной капусты, примет только один выбор, а не три, независимо от того, что вам могут сказать некоторые специалисты.

source: Adder
ru_ru: Сумматор

source: Memory components
ru_ru: Компоненты памяти

source: To help with counting, each group of four values has a larger space between.
ru_ru: Чтобы помочь в подсчёте, каждая группа из четырех значений имеет больший промежуток между ними.

source: The Window tab
ru_ru: Вкладка Окно

source: Data Bit Width
ru_ru: Разрядность данных

source: The number of bits used to indicate each of the knob's coordinates.
ru_ru: Число битов, используемых для отображения каждой координаты рукоятки.

source: South edge, right side indicated by gray circle (input, bit width matches Select Bits attribute)
ru_ru: Южный край, правая сторона, отмечен серым кружком (вход, разрядность соответствует атрибуту Выбирающие биты)

source: Wires in Logisim must be horizontal or vertical.
ru_ru: Провода в Logisim должны быть горизонтальными или вертикальными.

source: The AND, OR, NAND, and NOT gates each compute the respective function of the inputs, and emit the result on the output.
ru_ru: Элементы И, ИЛИ, И-НЕ, ИЛИ-НЕ вычисляют соответствующую функцию от значений на входах и выдают результат на выход.

source: Light Persistence
ru_ru: Продолжительность свечения

source: If the value is Rising Edge, then when the clock input changes from 0 to 1, the data input is processed (when enabled by the write-enable and clear inputs).
ru_ru: Если значение - Передний фронт, то когда значение тактового входа изменяется с 0 на 1, то значение с входа Данные обрабатывается (если разрешено входами Разрешение записи и Очистка).

source: As of the current release, the following components in the built-in libraries support labels.
ru_ru: По состоянию на текущий релиз, следующие компоненты во встроенных библиотеках поддерживают метки.

source: Logisim detects oscillation using a fairly simple technique: If the circuit simulation seems to many iterations, then it will simply give up and report oscillation.
ru_ru: Logisim обнаруживает возбуждение с помощью довольно простого метода: если похоже, что при моделировании схемы слишком много итераций, то он просто сдаётся и сообщает о возбуждении.

source: Lower To Bottom
ru_ru: Опустить вниз
